# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#
# Пример:
#
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

my_list1 = [2, 3, 4, 5, 6, 7]
my_list2 = []
i = 0

while i < (len(my_list1) / 2):
    my_list2.append(my_list1[i] * my_list1[-1 - i])
    i += 1

print(my_list2)




